
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
embedding (Embedding)        (128, None, 32)           640032
_________________________________________________________________
conv1d (Conv1D)              (128, None, 32)           1056
_________________________________________________________________
lstm (LSTM)                  (128, None, 128)          82432
_________________________________________________________________
dense (Dense)                (128, None, 20001)        2580129
=================================================================
Total params: 3,303,649
Trainable params: 3,303,649
Non-trainable params: 0
